InformationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Продажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество автомобилей при продаже автомобилей, при ремонтах - количество часов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точка</Name>
					<Comment>С 05.06.2020 для заказ-нарядов ОУ точка заказ-наряда подменяется точкой машинозаезда, т.к. это могут быть разные точки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время события (совпадает с датой документа - регистратора)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопДата</Name>
					<Comment>Дополнительная дата: для заказ-наряда это дата окончания (закрытия)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Comment>Виды событий: "продажа", "ремонт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Возможен список значений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаОбъекта</Name>
					<Comment>Комлектация/ВидРемонта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Наименование покупателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента (контрагента)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникГУИД</Name>
					<Comment>ГУИД сотрудника из базы-источника. Для ОУ - это не сотрудник из реализации, а сотрудник из сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругиеСотрудники</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Comment>ГУИД покупателя из базы-источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Для заказ-нарядов новой ОУСТО - дата приемки авто (ЗаказНаряд.ДатаНачалаФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пакет</Name>
					<Comment>Пакет продаж, в который входит данный документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Для новой ОУ СТО - дата окончания факт (ДатаОкончанияФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Наименование контактного лица</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магистральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машинозаезд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаЗаказНаряда</Name>
					<Comment>Истинная точка заказ-наряда, не подменяемая на точку машинозаезда</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Продажи/Ext/ManagerModule.bsl
Функция Загрузить(	Сигнатура,  
					Проект = "",
					Точка = "", 
					Дата = '00010101', 
					Номер = "", 
					ДопДата = '00010101',
					Вид = "", 
					Объект = "", 
					ХарактеристикаОбъекта = "", 
					Контрагент = "", 
					АбонентВнешний = "", 
					Сотрудник = "",
					ДругиеСотрудники = "",
					Заказчик = "",
					КонтактноеЛицо = "",
					СотрудникГУИД ="",
					Количество = 0,
					Магистральный = Ложь,
					Машинозаезд = "",
					ТочкаЗаказНаряда = "") Экспорт
	
	Доступно = 		ТипЗнч(Сигнатура) = Тип("Строка")
				И 	ЗначениеЗаполнено(Сигнатура)
				И 	ТипЗнч(Проект) 	= Тип("Строка")
				И ТипЗнч(Точка)					= Тип("Строка")
				И ТипЗнч(Дата) 					= Тип("Дата")
				И ТипЗнч(Номер)					= Тип("Строка")
				И ТипЗнч(ДопДата) 				= Тип("Дата")
				И ТипЗнч(Вид)					= Тип("Строка")
				И ТипЗнч(Объект)				= Тип("Строка")	
				И ТипЗнч(ХарактеристикаОбъекта) = Тип("Строка")
				И ТипЗнч(Контрагент) 			= Тип("Строка")
				И ТипЗнч(АбонентВнешний)		= Тип("Строка")
				И ТипЗнч(Сотрудник) 			= Тип("Строка");
	Если Не Доступно Тогда
		Возврат Ложь
	КонецЕсли;
	
	НЗ = РегистрыСведений.Продажи.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура = Сигнатура;
	НЗ.Прочитать();	
	Если НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ.Сигнатура 				= Сигнатура;
	
	НЗ.Количество				= Количество;
	
	НЗ.Проект					= Проект;
	НЗ.Точка					= Точка;
	НЗ.Дата 					= Дата;
	НЗ.Номер 					= Номер;
	НЗ.ДопДата					= ДопДата;
	НЗ.Вид						= Вид;
	НЗ.Объект		 			= Объект;
	НЗ.ХарактеристикаОбъекта 	= ХарактеристикаОбъекта;
	НЗ.Контрагент				= Контрагент;
	НЗ.АбонентВнешний			= АбонентВнешний;
	НЗ.Сотрудник				= Сотрудник;
	НЗ.СотрудникГУИД			= СотрудникГУИД;
	НЗ.ДругиеСотрудники			= ДругиеСотрудники;
	НЗ.Заказчик					= Заказчик;
	НЗ.КонтактноеЛицо			= КонтактноеЛицо;
	НЗ.Магистральный			= Магистральный;
	НЗ.Машинозаезд				= Машинозаезд;
	НЗ.ТочкаЗаказНаряда			= ТочкаЗаказНаряда;
	
	Попытка
		НЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Продажи.Загрузить().Ошибка записи", УровеньЖурналаРегистрации.Ошибка, ,"Сигнатура = "+Сигнатура, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции

Функция УстановиЗначениеРеквизита(Сигнатура, ИмяРеквизита, ЗначениеРеквизита) Экспорт
			
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка") И ЗначениеЗаполнено(Сигнатура) И ТипЗнч(ИмяРеквизита)=Тип("Строка") И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено") И ЗначениеЗаполнено(ЗначениеРеквизита);	
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.Продажи.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Сигнатура	=	Сигнатура;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.Продажи.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;

	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, , "Сигнатура="+Сигнатура+"; ИмяРеквизита="+ИмяРеквизита+"; ЗначениеРеквизита="+ЗначениеРеквизита, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
		
КонецФункции

Функция УстановиДатуЗакрытияИСотрудника(Сигнатура, ДатаЗакрытия, Сотрудник)Экспорт
	
	Доступно = ТипЗнч(Сигнатура) = Тип("Строка") И ЗначениеЗаполнено(Сигнатура);	
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.Продажи.СоздатьМенеджерЗаписи();
	НЗ.Сигнатура	=	Сигнатура;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат Ложь
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;

	Если Не ЗначениеЗаполнено(НЗ.ДопДата) И ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		НЗ.ДопДата = ДатаЗакрытия;
		ИзмененоЗначениеРеквизита = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НЗ.Сотрудник) И ЗначениеЗаполнено(Сотрудник) Тогда
		НЗ.Сотрудник = Сотрудник;
		ИзмененоЗначениеРеквизита = Истина;
	КонецЕсли;
	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат Ложь;
	КонецЕсли;

	Попытка
			НЗ.Записать();
			Возврат Истина;
	Исключение
			ЗаписьЖурналаРегистрации("УстановиДатуЗакрытияИСотрудника()", УровеньЖурналаРегистрации.Ошибка, , "Сигнатура="+Сигнатура, ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
			Возврат Ложь;
	КонецПопытки;
	
КонецФункции
